# DATA 202 - Module 7: Storage Strategies
* Instructor: Dr. Josh Fagan
* [Jupyter Notebook Tips and Tricks](http://bit.ly/34embJh)
* [Markdown Cheatsheet](http://bit.ly/2UkNVXV)
* Magic command to list all variables: `%whos`

### Instructions

Welcome to the Module 8 assignment of DATA 202. This assignment is meant to help you review/familiarize yourself with the basics of SQL for storing data.

To receive credit for a assignment, answer all questions correctly and submit before the deadline listed on Canvas.

---
### Collaboration Policy

Data science is a collaborative activity. While you may talk with others about the labs, we ask that you **write your solutions individually**. If you do discuss the assignments with others please **include their names** below.

**Collaborators**: *list collaborators here*
* Joseph Beller (vol study center)
* Y

## Exercise 0 - Setup
Run the following cells, without changes, to setup SQL and create the notebooks table.

In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [2]:
%%sql

CREATE TABLE pets(id int, Name varchar(50), Animal varchar(50), Age int);
INSERT INTO pets VALUES(1, 'Beverly', 'Rabbit', 4);
INSERT INTO pets VALUES(2, 'Jasper', 'Cat', 12);
INSERT INTO pets VALUES(3, 'Moose', 'Dog', 9);
INSERT INTO pets VALUES(4, 'Reagan', 'Dog', 6);
INSERT INTO pets VALUES(5, 'Franklin', 'Dog', 7);
SELECT * FROM pets

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Beverly', 'Rabbit', 4),
 (2, 'Jasper', 'Cat', 12),
 (3, 'Moose', 'Dog', 9),
 (4, 'Reagan', 'Dog', 6),
 (5, 'Franklin', 'Dog', 7)]

## Exercise 1
Write a query to return the `Age`, `Name`, `Animal` features (in that order) of the records that have a `Name` feature that starts with 'A' through 'J'.

In [3]:
%%sql
SELECT Age, Name, Animal FROM pets 
WHERE Name BETWEEN 'A' AND 'K'

 * sqlite://
Done.

[(4, 'Beverly', 'Rabbit'), (12, 'Jasper', 'Cat'), (7, 'Franklin', 'Dog')]

### Exercise 1 Grading Notes

Exercise 1 Grade:

25/25

## Exercise 2
Write a query to return all the features for records that have 'lin' in the name or are older than 10.

In [4]:
%%sql 
SELECT * FROM pets 
WHERE Name LIKE '%lin%' OR Age > '10'

 * sqlite://
Done.

[(2, 'Jasper', 'Cat', 12), (5, 'Franklin', 'Dog', 7)]

### Exercise 2 Grading Notes

Exercise 2 Grade:

25/25

## Exercise 3
"Dog years" are usually calculated as 7 times "Human years."

Write a query to return each dogs name, and age multiplied by 7.

In [5]:
%%sql 
SELECT (Age*7) AS Age, Name FROM pets
WHERE Animal = 'Dog'

 * sqlite://
Done.

[(63, 'Moose'), (42, 'Reagan'), (49, 'Franklin')]

### Exercise 3 Grading Notes

Exercise 3 Grade:

25/25

## Exercise 4
Write a query to create the string 'Name is a Animal' for each animal in the table.

Only return the first 3 records.

In [9]:
%%sql 
SELECT Name || ' is a ' || Animal AS NameAsAnimal FROM pets
LIMIT 3

 * sqlite://
Done.

[('Beverly is a Rabbit',), ('Jasper is a Cat',), ('Moose is a Dog',)]

### Exercise 4 Grading Notes

Exercise 4 Grade:

25/25

---
## Submission

Make sure you have run all cells in your notebook in order before running the cell below, so that all images/graphs appear in the output. I recommend going to the "Kernel" menu at the top and selecting "Restart & Run All". This will ensure that everything runs correctly when it is run sequentially.

## Final Grade

100/100